In [1]:
# Because this is a wikipedia page i would simply use the package 'wikipedia'

import pandas as pd
import wikipedia as wp
html = wp.page("Comma-separated_values").html().encode("UTF-8")
try: 
    data = pd.read_html(html)[1]
except IndexError:
    data = pd.read_html(html)[0] #ignore the content table

In [2]:
data

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000.0
1,1999,Chevy,"Venture ""Extended Edition""",NaN,4900.0
2,1999,Chevy,"Venture ""Extended Edition, Very Large""",NaN,5000.0
3,1996,Jeep,Grand Cherokee,"MUST SELL!air, moon roof, loaded",4799.0

In [3]:
df = pd.DataFrame(data)
df.to_csv (r'C:\Users\e2u\Desktop\cars_example.csv', index = False, header=True)

In [4]:
# We could also use the BeautifulSoup package:

import pandas as pd
import requests
from bs4 import BeautifulSoup


URL = requests.get('https://en.wikipedia.org/wiki/Comma-separated_values').text
soup = BeautifulSoup(URL, 'html.parser')
table = soup.find('table', class_="wikitable")

df2 = pd.read_html(str(table))
df2 = pd.concat(df2)
print(df2)

   Year   Make                                   Model  \
0  1997   Ford                                    E350
1  1999  Chevy              Venture "Extended Edition"
2  1999  Chevy  Venture "Extended Edition, Very Large"
3  1996   Jeep                          Grand Cherokee

                        Description   Price
0                     ac, abs, moon  3000.0
1                               NaN  4900.0
2                               NaN  5000.0
3  MUST SELL!air, moon roof, loaded  4799.0

In [5]:
df.to_csv (r'C:\Users\e2u\Desktop\cars_example2.csv', index = False, header=True)